Revit 2015 API
Wire.RemoveVertex Method
 Removes the vertex corresponding to the specified index.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public void RemoveVertex(
	int index
)
Visual Basic
Public Sub RemoveVertex ( _
	index As Integer _
)
Visual C++
public:
void RemoveVertex(
	int index
)
Parameters
index
Type: System.Int32
 The index which should be in [0, NumberOfVertices).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index should be between 0 and the number of vertices of the wire.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  The wire has only 2 vertices, so one cannot be removed.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace